# -*- coding: utf8 -*-

import telebot
from congst import *
import os
bot = telebot.TeleBot(api_token)

def choice2(vibor, way):
# ==================================================================================================
# ----------------------⚖️Оценка залогов---------------------------------------------------------
# SAMSUNG========================================================================================
    if (vibor == '📱 SAMSUNG') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('📊Характеристики', '📳Внешний осмотр')
        keyboard.row('📴Работоспособность')
        keyboard.row('🈴Определения реплик')
        keyboard.row('✳️Полезные комбинации')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'SAMSUNG'
        return keyboard, text
# IPHONE============================================================================================
    elif (vibor == '📱 IPHONE') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('📊Характеристики', '📳Внешний осмотр')
        keyboard.row('📴Работоспособность')
        keyboard.row('🈴Определения реплик')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'IPHONE'
        return keyboard, text
# другие модели====================================================================================
    elif (vibor == '📱 другие модели') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)

        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '📱 другие модели'
        return keyboard, text
# ЗОЛОТО==========================================================================================
    elif (vibor == '💍 ЗОЛОТО') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('📒О золоте', '⚠️ПРОВЕРКА-ЗОЛОТА')
        keyboard.row('💰ОЦЕНКА СТОИМОСТИ')
        keyboard.row('📣Полезная информация')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '💍 ЗОЛОТО'
        return keyboard, text
# НОУТБУКИ==================================================================================================
    elif (vibor == '💻 НОУТБУКИ') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Виды ноутбуков')
        keyboard.row('2️⃣Визуальный осмотр')
        keyboard.row('3️⃣Технические характеристики')
        keyboard.row('4️⃣Вспомогательные программы')
        keyboard.row('5️⃣Проверка на прошитость')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '💻 НОУТБУКИ'
        return keyboard, text
# НАУШНИКИ AIRPODS==================================================================================================
    elif (vibor == '🎧 НАУШНИКИ AIRPODS') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Виды AirPods')
        keyboard.row('2️⃣Подключение и проверка AirPods')
        keyboard.row('3️⃣Выявления реплик')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '🎧 НАУШНИКИ AIRPODS'
        return keyboard, text
# ЧАСЫ APPLE WHATCH=================================================================================================
    elif (vibor == '⌚ ЧАСЫ APPLE WHATCH') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Виды', '2️⃣Оценка состояния')
        keyboard.row('3️⃣Разрыв пары', '4️⃣Зарядные станции')
        keyboard.row('5️⃣Ремешки часов', '6️⃣Серия и размер')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '⌚ ЧАСЫ APPLE WHATCH'
        return keyboard, text
# ФОТО АППАРАТЫ=================================================================================================
    elif (vibor == '📷 ФОТО АППАРАТЫ') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Виды', '2️⃣Название частей')
        keyboard.row('3️⃣Визуальный осмотр')
        keyboard.row('4️⃣Работоспособность', '5️⃣Примечание')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '📷 ФОТО АППАРАТЫ'
        return keyboard, text
# ШУБЫ==================================================================================================
    elif (vibor == '🧥 ШУБЫ') and (way[len(way)-1] == '⚖Оценка залогов'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Виды', '2️⃣Визуальный осмотр')
        keyboard.row('3️⃣Отличие Норки')
        keyboard.row('4️⃣Плюсы и минусы моделей')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '🧥 ШУБЫ'
        return keyboard, text
# ==================================================================================================
# ----------------------📞Колл-центр----------------------------------------------------------------
# Колл-центр==================================================================================================
    elif (vibor == '1') and (way[len(way)-1] == '📞Колл центр'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '1'
        return keyboard, text
# ==================================================================================================
# ----------------------🛡Обучение по продажам----------------------------------------------------------------
# Вводный курс=================================================================================================
    elif (vibor == '1️⃣Вводный курс') and (way[len(way)-1] == '🛡Обучение по продажам'):
        # Видео
        # FAQ PDF
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад')
        text = 'Водный курс'
        vvedenie = "Вы наверняка сами не раз были свидетелями как недовольный с утра продавец, " \
                   "через силу пытаясь улыбнуться и делая вам одолжение, начинает продавать. " \
                   "Не приятно, правда? На лице у такого сотрудника видно, что он не готов не только к консультации, " \
                   "но и к работе вообще. После такого настроя на грядущий день, успешные сделки и удовлетворенные клиенты – просто миф! " \
                   "Понимаете о чем я? Ощущаете важность первого этапа?" \
                   " Искусство произвести приятное впечатление с первой минуты разговора умножит шансы превратить собеседника в клиента."
        return keyboard, text, vvedenie
# Шаги продаж===============================================================================================
    elif (vibor == '2️⃣Шаги продаж') and (way[len(way)-1] == '🛡Обучение по продажам'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад', 'ШАГ 1️⃣ ПОДГОТОВКА')
        text = 'Шаги продаж'
        return keyboard, text
# Доп курсы=================================================================================================
    elif (vibor == '3️⃣Доп курсы') and (way[len(way) - 1] == '🛡Обучение по продажам'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Постановка целей по Смарт', 'Работа с голосом')
        keyboard.row('Small talk', '↩️Назад')
        text = 'Доп курсов'
        return keyboard, text


# ==================================================================================================
# ----------------------🔐ХРАНЕНИЕ ЗАЛОГОВ----------------------------------------------------------
# ХРАНЕНИЕ ЗАЛОГ================================================================================================
    elif (vibor == '🔐ХРАНЕНИЕ ЗАЛОГО') and (way[len(way)-1] == '🔐ХРАНЕНИЕ ЗАЛОГО'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '0'
        return keyboard, text
# ==================================================================================================
# ----------------------🚨Безопасность---------------------------------------------------------------
# Безопасность==================================================================================================
    elif (vibor == '🚨Безопасность') and (way[len(way)-1] == '🚨Безопасность'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '0'
        return keyboard, text
# ==================================================================================================
# ----------------------⚒Рабочие процессы-----------------------------------------------------------
# Рабочие процесс==================================================================================================
    elif (vibor == '⚒Рабочие процесс') and (way[len(way)-1] == '⚒Рабочие процесс'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '0'
        return keyboard, text
# ==================================================================================================
# ----------------------🎛Работа с оборудованием-----------------------------------------------------
# Работа с оборудованием==================================================================================================
    elif (vibor == '🎛Работа с оборудованием') and (way[len(way)-1] == '🎛Работа с оборудованием'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '0'
        return keyboard, text
# ==================================================================================================
# ----------------------🚙По выездной группы--------------------------------------------------------
# По выездной группы==================================================================================================
    elif (vibor == '🚙По выездной группы') and (way[len(way)-1] == '🚙По выездной группы'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '0'
        return keyboard, text
# ==================================================================================================
# ----------------------🎓Для Директоров------------------------------------------------------------
# Для Директоров====================================================================================
    elif (vibor == '🎓Для Директоров') and (way[len(way)-1] == '🎓Для Директоров'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣', '2️⃣', '3️⃣')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = '0'
        return keyboard, text

