# -*- coding: utf8 -*-
menu = '1'
way_list = []
import telebot
from congst import *
import os
bot = telebot.TeleBot(api_token)
from menu1 import *
from menu2 import *
from menu3 import *
from menu4 import *
from menu5 import *
from main_back_buttons import *
study_list = []

@bot.message_handler(content_types=['text'])
def start_message(message):
    global menu, way_list
    if menu <= "0" : menu = '1'
# 1-меню ==============================================================================
#===Старт меню===========================================================================
    if  menu == '1' or message.text.lower() == "/start" or message.text.lower() == '🔁Главное меню':
        keyboard = start_menu()
        bot.send_message(message.from_user.id, "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                        reply_markup=keyboard)
        way_list.append('🔁Главное меню')
        menu = '2'
    else:
# 2-меню ==============================================================================
        if menu == '2':
# ===Главная===========================================================================
            if message.text.lower() == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 1 кнопки===========================================================================
# ===========================================================================================================
            else:
                key1, text = choice1(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key1)
                menu = '3'
                way_list.append(message.text)

# 3-меню ==============================================================================
        elif menu == '3':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход во 2 кнопки===========================================================================
# ===========================================================================================================
            elif message.text == '1️⃣Вводный курс':
                key2, text, text2 = choice2(message.text, way_list)
                video = open("videos/vvedenie.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text + "\n" + text2,
                                 reply_markup=key2)
                menu = '4'
                way_list.append(message.text)
                study_list.append("Введение")
                study_list.append("text")
            else:
                key2, text = choice2(message.text, way_list)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key2)
                menu = '4'
                way_list.append(message.text)
# 4-меню ==============================================================================
        elif menu == '4':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 3 кнопки===========================================================================
# ===========================================================================================================
            else:
                key3, text, text2 = choice3(message.text, way_list)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text + "\n" + text2,
                                 reply_markup=key3)
                menu = '5'
                way_list.append(message.text)
                study_list.append("Техническая")
                study_list.append("text")
# 5-меню ==============================================================================
        elif menu == '5':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 4 кнопки===========================================================================
# ===========================================================================================================
            else:
                key4, text = choice4(message.text)
                video = open("videos/Tehnicheskaya.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()

                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key4)
                menu = '6'
                way_list.append(message.text)
                study_list.append("Техническая")
                study_list.append("text")
# 6-меню ==============================================================================
        elif menu == '6':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 5 кнопки===========================================================================
# ===========================================================================================================
            else:
                if message.text == 'Задание':
                    pass # как добавлю базу, будем записывать в таблицу ответы!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                elif message.text == '↪️Далее':
                    key5, text = choice5(message.text)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key5)
                    menu = '7'
                    way_list.append(message.text)
# 7-меню ==============================================================================
        elif menu == '7':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 6 кнопки===========================================================================
# ===========================================================================================================
            else:
                key6, text = choice6(message.text)
                video = open("videos/Emocionalnaya.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()

                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key6)
                menu = '8'
                way_list.append(message.text)
                study_list.append("Эмоциональная")
                study_list.append("text")


# 8-меню ==============================================================================
        elif menu == '8':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 7 кнопки===========================================================================
# ===========================================================================================================
            else:
                key7, text = choice7(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key7)
                menu = '9'
                way_list.append(message.text)
# 9-меню ==============================================================================
        elif menu == '9':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 8 кнопки===========================================================================
# ===========================================================================================================
            else:
                key8, text = choice8(message.text)
                video = open("videos/privetstvie_i_ustanovlenie_kontakta.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()

                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text, reply_markup=key8)
                menu = '10'
                way_list.append(message.text)
                study_list.append("Приветствие и установление контакта")
                study_list.append("text")


# 10-меню ==============================================================================
        elif menu == '10':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===Нвход в 9 кнопки===========================================================================
# ===========================================================================================================
            else:
                key9, text = choice9(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key9)
                menu = '11'
                way_list.append(message.text)
# 11-меню ==============================================================================
        elif menu == '11':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 10 кнопки===========================================================================
# ===========================================================================================================
            else:
                key10, text = choice10(message.text)
                video = open("videos/viyavlenie_potrebnostei.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key10)
                menu = '12'
                way_list.append(message.text)
                study_list.append("Выявление потребности")
                study_list.append("text")
# 12-меню ==============================================================================
        elif menu == '12':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 11 кнопки===========================================================================
# ===========================================================================================================
            else:
                key11, text = choice11(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key11)
                menu = '13'
                way_list.append(message.text)
# 13-меню ==============================================================================
        elif menu == '13':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 12 кнопки===========================================================================
# ===========================================================================================================
            else:
                key12, text = choice12(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key12)
                menu = '14'
                way_list.append(message.text)
# 14-меню ==============================================================================
        elif menu == '14':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 13 кнопки===========================================================================
# ===========================================================================================================
            else:
                key13, text = choice13(message.text)
                video1 = open("videos/prezentacia1.mp4", "rb")
                video2 = open("videos/prezentacia2.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video1, video2, supports_streaming=True)
                video1, video2.close()
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key13)
                menu = '15'
                way_list.append(message.text)
                study_list.append("Презентация")
                study_list.append("text")

# 15-меню ==============================================================================
        elif menu == '15':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===Нвход в 14 кнопки===========================================================================
# ===========================================================================================================
            else:
                key14, text = choice14(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key14)
                menu = '16'
                way_list.append(message.text)
# 16-меню ==============================================================================
        elif menu == '16':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 15 кнопки===========================================================================
# ===========================================================================================================
            else:
                key15, text = choice15(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key15)
                menu = '17'
                way_list.append(message.text)
# 17-меню ==============================================================================
        elif menu == '17':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 16 кнопки===========================================================================
# ===========================================================================================================
            else:
                key16, text = choice16(message.text)
                video = open("videos/otrabotka_vozrajenii.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key16)
                menu = '18'
                way_list.append(message.text)
                study_list.append("Отработка возражений")
                study_list.append("text")
# 18-меню ==============================================================================
        elif menu == '18':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 17 кнопки===========================================================================
# ===========================================================================================================
            else:
                key17, text = choice17(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key17)
                menu = '19'
                way_list.append(message.text)
# 19-меню ==============================================================================
        elif menu == '19':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 18 кнопки===========================================================================
# ===========================================================================================================
            else:
                key18, text = choice18(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key18)
                menu = '20'
                way_list.append(message.text)
# 20-меню ==============================================================================
        elif menu == '20':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 19 кнопки===========================================================================
# ===========================================================================================================
            else:
                key19, text = choice19(message.text)
                video = open("videos/zaverschenie_sdelki.mp4", "rb")
                bot.send_chat_action(message.from_user.id, 'upload_video')
                bot.send_video(message.from_user.id, video, supports_streaming=True)
                video.close()
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key19)
                menu = '21'
                way_list.append(message.text)
                study_list.append("Завершение сделки")
                study_list.append("text")
# 21-меню ==============================================================================
        elif menu == '21':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 20 кнопки===========================================================================
# ===========================================================================================================
            else:
                key20, text = choice20(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key20)
                menu = '22'
                way_list.append(message.text)
# 22-меню ==============================================================================
        elif menu == '22':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 21 кнопки===========================================================================
# ===========================================================================================================
            else:
                key21, text = choice21(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key21)
                menu = '23'
                way_list.append(message.text)
# 23-меню ==============================================================================
        elif menu == '23':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)
# ===========================================================================================================
# ===вход в 22 кнопки===========================================================================
# ===========================================================================================================
            else:
                key22, text = choice22(message.text)
                name = message.from_user.first_name
                bot.send_message(message.from_user.id, "Дорогой, " + name + "!\nВы в меню " + text,
                                 reply_markup=key22)
                menu = '24'
                way_list.append(message.text)
# 24-меню ==============================================================================
        elif menu == '24':
# ===Главная===========================================================================
            if message.text == '🔁Главное меню':
                menu, way_list, keyboard = mainMenuButton(way_list, menu)
                bot.send_message(message.from_user.id,
                                 "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                 reply_markup=keyboard)
                menu = '2'
# ===Назад===========================================================================
            elif message.text == '↩️Назад':
                way_list, menu, button = backButton(way_list, menu)
                message.text = button
                start_message(message)

                way_list.append(message.text)


bot.polling(none_stop=True, interval=0)
